{
  "消肿": "络石藤，猫爪草，皂角刺，王不留行，山香圆叶，牛蒡子，重楼，金花茶，泽兰，紫檀粉，大腹皮，鹿角，川加皮，竹节参，三七，荆芥，蒲公英，杠板归，桑白皮，麻黄，益母草，连翘，防己，白芷，红芪，夏枯草，天花粉，栀子，合欢皮，黄芪，远志，茯苓",
  "通乳": "王不留行，通草",
  "润燥": "桑椹，桑叶，玉竹，阿胶，瓜蒌，天冬，知母",
  "益精": "肉苁蓉，枸杞子",
  "缩尿": "沙苑子，覆盆子，补骨脂，益智，菟丝子，山萸肉",
  "祛风": "伸筋草，藁本，忍冬藤，络石藤，桑枝，丝瓜络，白鲜皮，地肤子，萆薢，狗脊，威灵仙，松叶，苍耳子，川加皮，徐长卿，僵蚕，前胡，路路通，蒺藜，独活，淫羊藿，防己，巴戟天，天麻，夏天无，细辛，桑寄生，羌活，菟丝子，防风，苍术，川芎，首乌藤",
  "健骨": "狗脊，鹿角，川加皮，龟甲，淫羊藿，巴戟天，续断，桑寄生，杜仲，牛膝",
  "化气": "桂枝",
  "芳香": "佩兰",
  "引血下行": "牛膝",
  "止喘": "地龙，紫苏子，沉香，灵芝，桑白皮，补骨脂，麻黄，牡荆子，苦杏仁，桃仁，磁石",
  "止血": "白茅根，艾叶，姜炭，地榆，荷叶，紫檀粉，竹节参，仙鹤草，琥珀，三七，海螵蛸，龟甲，炮姜，阿胶，赭石，续断，旱莲草，珍母，浮小麦，黄芩，龙骨，地黄",
  "固涩": "仙鹤草，金樱子，益智，浮小麦，五味子，龙骨，牡蛎",
  "杀虫": "花椒，皂角刺，松叶，苦参，川楝子，槟榔，乌梅",
  "催乳": "丝瓜络，木通",
  "平肝阳": "金礞石，蒺藜，石决明，钩藤，菊花，赭石，天麻，磁石，珍母，牡蛎，白芍",
  "去斑": "菟丝子",
  "渗湿": "车前子，猪苓，泽泻，茯苓",
  "调经": "王不留行，泽兰，姜黄，路路通，素馨花，益母草，红花，鸡血藤，牛膝，香附，丹参，当归，白芍",
  "疗疮": "皂角刺，牛蒡子，海螵蛸，滑石，红芪，黄芪",
  "散寒": "小茴香，藁本，花椒，艾叶，檀香，辛夷，苍耳子，荆芥，附片，麻黄，紫苏叶，乌药，吴茱萸，白芷，细辛，羌活，肉桂，附子，苍术，干姜，生姜",
  "温肺": "细辛，干姜",
  "燥湿": "白鲜皮，滑石，橘红，白芷，佛手，黄柏，苍术，厚朴，黄连，黄芩，陈皮，半夏，白术",
  "补肝": "狗脊，沙苑子，覆盆子，酒萸肉，续断，桑寄生，枸杞子，杜仲，菟丝子，女贞子，牛膝，山萸肉，酸枣仁",
  "利咽": "木蝴蝶，射干，山香圆叶，牛蒡子，蝉蜕，诃子，薄荷，桔梗",
  "通窍": "辛夷，苍耳子，白芷，细辛",
  "固脱": "酒萸肉，人参",
  "固表": "红芪，黄芪",
  "排脓": "皂角刺，白芷，红芪，天花粉，桔梗，薏苡仁，黄芪",
  "补阳": "肉苁蓉，淫羊藿，巴戟天，肉桂",
  "截疟": "仙鹤草，何首乌，槟榔",
  "养心": "龟甲，莲子，龙眼肉，柏子仁，酸枣仁",
  "安胎": "紫苏梗，桑寄生，杜仲，菟丝子，砂仁，黄芩，白术",
  "利胆": "茵陈，郁金",
  "黑发": "女贞子",
  "救逆": "附片，附子，干姜",
  "补肾": "桑螵蛸，狗脊，沙苑子，薄树芝，覆盆子，补骨脂，酒萸肉，龟甲，黄精，芡实，续断，旱莲草，莲子，桑寄生，枸杞子，杜仲，菟丝子，女贞子，牛膝，山萸肉，山药，浮小麦，五味子",
  "生肌": "地榆，白薇，海螵蛸，红芪，黄芪，龙骨",
  "益气": "灵芝，黄精，红芪，黑枣，人参，太子参，五味子，大枣，黄芪，白术，甘草",
  "固经": "龟甲",
  "退翳": "蝉蜕",
  "舒筋": "伸筋草，木瓜，鸡血藤，夏天无，五指毛桃，薏苡仁",
  "散结": "猫爪草，芒果核，僵蚕，薤白，荆芥，醋鳖甲，蒲公英，连翘，贝母，瓜蒌，夏枯草，玄参，薏苡仁，枳实，牡蛎，半夏",
  "开胃": "稻芽，佩兰，余甘子，豆蔻，北沙参，麦芽，砂仁，石菖蒲",
  "消痈": "何首乌，丹参",
  "软坚": "瓦楞子，醋鳖甲",
  "升阳": "荷叶，红芪，葛根，升麻，黄芪，柴胡",
  "强筋": "牛大力，狗脊，鹿角，川加皮，淫羊藿，巴戟天，续断，桑寄生，杜仲，牛膝",
  "通经": "忍冬藤，桑枝，地龙，威灵仙，木通，大黄，牛膝，黄芪",
  "泻下": "大黄",
  "宽中": "大腹皮，橘红，紫苏梗，香附，枳壳",
  "止咳": "虎杖，紫苏子，鸡蛋花，枇杷叶，竹节参，灵芝，紫菀，诃子，杠板归，余甘子，贝母，牡荆子，苦杏仁，桃仁，乌梅，生姜，甘草",
  "除蒸": "黄柏",
  "消食": "三棱，芒果核，玫瑰花，莪术，莱菔子，稻芽，余甘子，青皮，布渣叶，红曲，鸡内金，槟榔，豆蔻，山楂，六神曲，麦芽，木香，枳实，石菖蒲",
  "润肺": "牛大力，紫菀，麻黄，贝母，黄精，百合，太子参，山药，麦冬，甘草",
  "疏散风热": "金银花，浮萍，牛蒡子，蝉蜕，桑叶，蔓荆子，连翘，菊花，薄荷",
  "温中": "沉香，炮姜，豆蔻，干姜，生姜",
  "纳气": "补骨脂",
  "解表": "荆芥，佩兰，豆豉，升麻，桂枝，柴胡",
  "明目": "沙苑子，蝉蜕，决明子，覆盆子，桑叶，蔓荆子，蒺藜，石决明，车前子，菊花，枸杞子，夏枯草，菟丝子，磁石，女贞子，苍术，珍母",
  "定惊": "重楼，金礞石，珍母",
  "透疹": "浮萍，牛蒡子，蝉蜕，荆芥，薄荷，升麻",
  "化痰": "猫爪草，虎杖，芒果核，紫苏子，射干，瓦楞子，车前草，竹节参，僵蚕，旋覆花，前胡，莱菔子，金礞石，紫菀，车前子，胆南星，贝母，橘红，牡荆子，瓜蒌，佛手，细辛，桔梗，厚朴，枳实，竹茹，枳壳，生姜，远志，陈皮，半夏，甘草",
  "通阳": "薤白",
  "降气": "紫菀，苦杏仁，半夏",
  "除湿": "伸筋草，藁本，桑枝，狗脊，金线莲，威灵仙，松叶，苍耳子，荷叶，苦参，川加皮，龙胆，徐长卿，海螵蛸，蔓荆子，佩兰，独活，芡实，木瓜，淫羊藿，牡荆子，巴戟天，豆蔻，藿香，茵陈，白扁豆，夏天无，桑寄生，羌活，防风，薏苡仁，砂仁，石菖蒲",
  "凉血": "络石藤，白茅根，金线莲，地榆，白薇，水牛角，荷叶，车前草，余甘子，地骨皮，赭石，大黄，旱莲草，玄参，赤芍，栀子，牡丹皮，郁金，丹参，地黄",
  "壮阳": "沙苑子，鹿角，补骨脂",
  "熄风": "僵蚕，金礞石，胆南星，钩藤，天麻",
  "止呕": "芦根，沉香，枇杷叶，旋覆花，吴茱萸，豆蔻，藿香，竹茹，生姜，桂枝，半夏",
  "清热": "忍冬藤，虎杖，芦根，地龙，白茅根，金银花，白鲜皮，射干，山香圆叶，鸡蛋花，地肤子，金线莲，重楼，金花茶，白薇，水牛角，木棉花，苦参，车前草，龙胆，决明子，前胡，川楝子，糯稻根，蒲公英，滑石，杠板归，车前子，通草，余甘子，胆南星，益母草，连翘，贝母，钩藤，布渣叶，地骨皮，菊花，云芝，瓜蒌，石斛，石膏，大黄，茵陈，豆豉，淡竹叶，薄荷，天花粉，玄参，黄柏，葛根，升麻，赤芍，泽泻，竹茹，黄连，栀子，牡丹皮，知母，黄芩，地黄，柴胡，甘草",
  "宁心": "人参，五味子，合欢皮，酸枣仁，茯苓",
  "止痢": "仙鹤草",
  "助阳": "桑螵蛸，附片，吴茱萸，肉桂，附子，桂枝",
  "清肺": "木蝴蝶，枇杷叶，桑叶，桑白皮，地骨皮，北沙参，天冬",
  "泻火": "芦根，龙胆，地骨皮，石膏，灯心草，大黄，淡竹叶，夏枯草，天花粉，玄参，黄柏，黄连，栀子，知母，黄芩",
  "活血": "三棱，虎杖，丝瓜络，王不留行，山香圆叶，玫瑰花，泽兰，松叶，鹿角，莪术，竹节参，琥珀，三七，姜黄，熟三七，蒺藜，益母草，红曲，延胡索，红花，鸡血藤，山楂，夏天无，桃仁，牛膝，牡丹皮，郁金，川芎，丹参，合欢皮，当归",
  "疏肝": "木蝴蝶，玫瑰花，川楝子，素馨花，青皮，佛手，薄荷，合欢花，香附，枳实，郁金，合欢皮，柴胡",
  "止痉": "地龙，水牛角，僵蚕，蝉蜕，琥珀，胆南星，钩藤，天麻，防风",
  "复脉": "人参",
  "清心": "木通，百合，郁金，丹参，麦冬",
  "补中": "黑枣，大枣",
  "养血": "熟三七，龟甲，阿胶，鸡血藤，红芪，龙眼肉，黑枣，人参，大枣，黄芪，当归，首乌藤，白芍，党参",
  "健脾": "薄树芝，稻芽，黄精，芡实，红曲，云芝，鸡内金，山楂，白扁豆，莲子，龙眼肉，六神曲，麦芽，人参，五指毛桃，木香，苍术，薏苡仁，太子参，山药，浮小麦，石菖蒲，陈皮，党参，白术，茯苓",
  "散邪": "忍冬藤，荆芥，升麻，防风",
  "温肾": "鹿角，附片，肉苁蓉，乌药，淫羊藿，益智，巴戟天，肉桂",
  "强身": "竹节参，仙鹤草",
  "调和药物": "甘草",
  "健胃": "石斛，山药，石菖蒲",
  "润肠": "紫苏子，郁李仁，决明子，何首乌，肉苁蓉，火麻仁，苦杏仁，桃仁，黑枣，柏子仁，当归",
  "止痛": "小茴香，藁本，三棱，虎杖，花椒，艾叶，檀香，瓦楞子，山香圆叶，玫瑰花，重楼，紫檀粉，沉香，莪术，竹节参，徐长卿，僵蚕，三七，姜黄，川楝子，附片，醋鳖甲，海螵蛸，素馨花，乌药，独活，吴茱萸，炮姜，紫苏梗，延胡索，红花，牡荆子，防己，白芷，鸡血藤，红芪，夏天无，佛手，细辛，羌活，肉桂，附子，防风，赤芍，木香，香附，栀子，郁金，川芎，丹参，当归，白芍，甘草",
  "止带": "海螵蛸，金樱子，芡实，白芷，莲子，山萸肉",
  "清肝": "重楼，桑叶，石决明，夏枯草",
  "发汗": "麻黄，桂枝",
  "通淋": "虎杖，郁李仁，王不留行，白薇，木通，车前草，琥珀，滑石，车前子，牛膝，薏苡仁",
  "解郁": "玫瑰花，素馨花，蒺藜，豆豉，合欢花，香附，郁金，合欢皮，柴胡",
  "通便": "紫苏子，郁李仁，决明子，何首乌，肉苁蓉，火麻仁，瓜蒌，苦杏仁，桃仁，黑枣，柏子仁，当归",
  "止痒": "花椒，地肤子，松叶，徐长卿，蒺藜",
  "治黄疸": "大黄，茵陈，郁金",
  "引气下行": "紫苏子，郁李仁，旋覆花，前胡，金礞石，吴茱萸，磁石",
  "回乳": "麦芽",
  "止遗": "桑螵蛸，覆盆子，金樱子，鸡内金",
  "涩精": "酒萸肉，莲子",
  "安神": "芦根，松叶，琥珀，薄树芝，灵芝，莲子，龙眼肉，磁石，合欢花，黑枣，人参，百合，珍母，柏子仁，五味子，丹参，大枣，合欢皮，远志，龙骨，首乌藤，牡蛎，酸枣仁，茯苓",
  "和胃": "小茴香，木蝴蝶，玫瑰花，薄树芝，素馨花，木瓜，山楂，六神曲",
  "利尿": "虎杖，芦根，地龙，白茅根，郁李仁，王不留行，鸡蛋花，地肤子，萆薢，浮萍，金花茶，白薇，泽兰，木通，木棉花，大腹皮，苦参，车前草，川加皮，旋覆花，琥珀，路路通，蒲公英，滑石，杠板归，桑白皮，麻黄，车前子，通草，益母草，猪苓，布渣叶，云芝，鸡内金，防己，槟榔，红芪，灯心草，淡竹叶，五指毛桃，牛膝，薏苡仁，泽泻，栀子，黄芪，白术，茯苓",
  "行气": "小茴香，三棱，芒果核，檀香，沉香，大腹皮，莪术，薤白，姜黄，川楝子，紫苏叶，乌药，橘红，延胡索，红芪，豆蔻，山楂，麦芽，木香，香附，干姜，枳壳，郁金，川芎，黄芪，陈皮",
  "降逆": "枇杷叶，赭石，厚朴，桂枝",
  "解毒": "忍冬藤，猫爪草，虎杖，金银花，白鲜皮，射干，山香圆叶，牛蒡子，金线莲，重楼，金花茶，地榆，白薇，水牛角，紫檀粉，木棉花，车前草，仙鹤草，醋鳖甲，蒲公英，杠板归，何首乌，益母草，连翘，菊花，云芝，大黄，豆豉，玄参，黄柏，升麻，薏苡仁，黄连，栀子，生姜，黄芩，柴胡，甘草",
  "制酸": "海螵蛸",
  "固精": "桑螵蛸，沙苑子，海螵蛸，覆盆子，补骨脂，芡实，鸡内金，益智，菟丝子，山萸肉，山药，龙骨",
  "醒脾": "佩兰",
  "降脂": "山楂，泽泻",
  "回阳": "附片，附子，干姜",
  "解暑": "鸡蛋花，荷叶，滑石，佩兰，藿香，白扁豆",
  "潜阳": "龟甲",
  "开胸": "瓜蒌",
  "温经": "艾叶，姜炭，炮姜，肉桂，桂枝",
  "宣肺": "牛蒡子，桔梗",
  "醒神": "石菖蒲",
  "调心肾": "远志",
  "益智": "人参，石菖蒲，远志",
  "和营": "紫檀粉",
  "止汗": "糯稻根，红芪，浮小麦，柏子仁，黄芪，白芍，白术，酸枣仁",
  "止泻": "姜炭，金樱子，诃子，补骨脂，车前子，吴茱萸，芡实，益智，莲子，菟丝子，葛根，薏苡仁，砂仁，龙骨",
  "除痹": "萆薢，独活",
  "通络": "络石藤，丝瓜络，姜黄，路路通，鸡血藤，红芪，天麻，肉桂，葛根，首乌藤",
  "固阴": "白芍",
  "滋阴": "糯稻根，桑椹，醋鳖甲，玉竹，龟甲，黄精，阿胶，石斛，北沙参，天冬，旱莲草，玄参，百合，知母，麦冬，牡蛎",
  "温脾": "姜炭，补骨脂，益智，砂仁",
  "除烦": "木通，石膏，豆豉，淡竹叶，竹茹，栀子",
  "收敛": "醋鳖甲，海螵蛸，乌梅，五味子",
  "活络": "伸筋草，忍冬藤，牛大力，桑枝，威灵仙，木瓜，夏天无，合欢花，五指毛桃，薏苡仁，黄芪",
  "和中": "檀香，瓦楞子，稻芽，紫苏叶，白扁豆，佛手，合欢花",
  "化浊": "萆薢，山楂，泽泻",
  "引火归元": "肉桂",
  "止渴": "芦根，玉竹，石膏，天花粉",
  "补肺": "薄树芝，人参，五指毛桃，党参",
  "化瘀": "三棱，瓦楞子，泽兰，紫檀粉，姜黄，熟三七，醋鳖甲，红曲，红花，大黄，桃仁，赤芍，牛膝，牡丹皮，丹参",
  "化滞": "薤白，莱菔子，青皮，布渣叶，山楂，大黄，六神曲，麦芽，厚朴，枳实，枳壳，黄芪，半夏",
  "排石": "鸡内金",
  "理气": "沉香，莱菔子，素馨花，稻芽，青皮，紫苏梗，牡荆子，槟榔，佛手，薄荷，合欢花，五指毛桃，厚朴，砂仁，枳实",
  "补血": "熟三七，桑椹，肉苁蓉",
  "生津": "芦根，桑椹，玉竹，余甘子，石斛，红芪，北沙参，天冬，淡竹叶，天花粉，乌梅，葛根，人参，太子参，山药，五味子，黄芪，麦冬，地黄，党参，酸枣仁",
  "补虚": "牛大力，竹节参，仙鹤草"
}